cases/openfoam-2.x/CounterFlow/Coarse/laminarPimpleSMOKE-flamelet/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   	uniform 101325.;

boundaryField
{
    fuelinlet
    {
        type            zeroGradient;
    }
    oxidizerinlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1.;
        p0              uniform 101325.;
        value           uniform 101325.;
    }
    bottom
    {
        type            wedge;
    }
    top
    {
        type            wedge;
    }
    walls
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
